Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_enforcement/public_order_and_powers_of_arrest.html.txt.tmx
Source language: en
Languages: ga

source: Public order offences and powers of arrest
ga: Cionta in aghaidh oird phoiblí agus cumhachtaí gabhála

source: The Gardaí have the powers to arrest without warrant people guilty of the following offences under the Criminal Justice (Public Order) Act, 1994:
ga: Tá sé de chumhacht ag comhaltaí den Gharda Síochána daoine a ghabháil gan barántas má tá siad ciontach as na coireanna seo a leanas faoin Acht um Cheartas Coiriúil (Ord Poiblí) 1994:

source: • Being intoxicated in a public place (Section 4)
ga: • Bheith ar meisce in áit phoiblí (Alt 4)

source: • Committing threatening or abusive behaviour in a public place (Section 6)
ga: • Iompraíocht bhagrach, mhaslach nó tharcaisneach a bheith ar siúl acu in áit phoiblí (Alt 6)

source: • Distributing or displaying threatening, obscene or insulting material in a public place (Section 7)
ga: • Ábhar bagrach graosta nó tharcaisneach a scaipeadh nó a thaispeáint in áit phoiblí (Alt 7)

source: • Failing to comply with the direction of a Garda (Section 8)
ga: • Mainneachtain ordú ó chomhalta den Gharda Síochána a chomhlíonadh (Alt 8)

source: • Entering a building, etc, with intent to commit an offence (Section 11)
ga: • Dul isteach i bhfoirgneamh etc., le hintinn cion a dhéanamh (Alt 11)

source: • Trespassing on a dwelling, etc. (Section 13)
ga: • Foghail a dhéanamh ar áitreabh, is araile (Alt 13)

source: • Committing acts of violent disorder (Section 15)
ga: • Bearta mírialtachta foréigní a dhéanamh (Alt 15)

source: • Committing affray (Section 16)
ga: • Bearta gráscair a dhéanamh (Alt 16)

source: • Blackmailing and demanding money with menaces (Section 17)
ga: • Dúmhál agus airgead a éileamh go bagrach (Alt 17)

source: • Committing an assault with intent to cause bodily harm or to commit an indictable offence (Section 18)
ga: • Ionsaí a dhéanamh a bhfuil sé d'aidhm aige dochar corpartha a dhéanamh nó cion indíotáilte a dhéanamh(Alt 18)

source: • Assaulting or obstructing a peace officer (Section 19)
ga: • Ionsaí nó toirmeasc a dhéanamh ar oifigeach síochána (Alt 19)

source: As can be seen from the above, the Gardaí are given a power of arrest without warrant for almost all of the offences contained in this Act
ga: Is léir ón liosta thuas go bhfuil sé de chumhacht ag comhaltaí den Garda Síochána daoine a ghabháil gan barántas de bharr formhór na gcoireanna a luaitear san Acht seo

source: For the offence of riot, violent disorder or affray, the bystander test is applied
ga: Cuirtear slat tomhais an fhéachadóra i bhfeidhm i gcás círéibe, mírialtachta foréigní nó gráscair

source: This means that if a bystander was present at the scene of the event or offence while it is being committed, they would fear for their own safety or the safety of someone else
ga: Ciallaíonn sé seo nach gá go mbeifeá i láthair ag teagmhas nó cion nuair atá sé á dhéanamh ach dá mbeifeá i láthair go mbeadh faitíos ort go mbeifeá féin nó duine eile i mbaol

source: In the Act a number of offences are included which only become offences if they are committed in a public place
ga: Tá roinnt cionta san Acht nach cionta iad mura ndéantar iad in áit phoiblí

source: For example, offences under Sections 4 to 9 of the Act are limited to a public place
ga: Baineann na coireanna ó Alt 4 go hAlt 9 le háiteanna poiblí amháin

source: The definition of a public place is contained in Section 3 of the Act and includes almost all places
ga: Thugtar sainmhíniú ar áit phoiblí in Alt 3 agus baineann sé le beagnach gach áit

source: It is one of the widest definitions of a public place in the criminal justice system
ga: Tá sé ar cheann de na sainmhínithe i leithne ar áit phoiblí sa chóras ceartais choiriúil go léir

source: You can read more about public order offences by clicking here
ga: Is féidir leat níos mó a léamh faoi Chionta in aghaidh oird phoiblí ach cliceáil anseo

source: Public order offences and the Adult Cautioning Scheme
ga: Cionta in aghaidh oird phoiblí agus an Scéim um Rabhadh Aosach

source: Under the Adult Cautioning Scheme (introduced in February 2006), a number of public order offences are included in the list of offences which may be dealt with by way of caution under the Scheme
ga: Tugadh isteach an Scéim um Rabhadh Aosach i mí Feabhra 2006 agus cuireadh roinnt cionta in aghaidh oird phoiblí leis an liosta cionta ar féidir déileáil leo trí rabhadh a thabhairt faoin Scéim

source: If you are cautioned under this Scheme it means you are not brought into the court system
ga: Má thugtar rabhadh duit faoin Scéim ní thugtar os comhair cúirte thú

source: The public order offences which can be dealt with by way of caution are:
ga: Is iad seo a leanas na cionta in aghaidh oird phoiblí ar féidir déileáil leo trí rabhadh a thabhairt:

source: • Committing disorderly conduct in a public place (Section 5)
ga: • Iompar mí-ordúil a bheith ar siúl in áit phoiblí (Alt 5)

source: • Threatening, abusive or insulting behaviour in a public place (Section 6)
ga: • Iompraíocht bhagrach, mhaslach nó tharcaisneach in áit phoiblí (Alt 6)

source: • Failing to comply with a direction of a Garda (Section 8)
ga: • Mainneachtain ordú ó chomhalta den Gharda Síochána a chomhlíonadh (Alt 8)

source: • Committing wilful obstruction (Section 9)
ga: • Bac toiliúil (bac d'aon ghnó) a dhéanamh (Alt 9)

source: • Entering a building, etc., with intent to commit an offence (Section 11)
ga: • Dul isteach i bhfoirgneamh, is araile, le hintinn cion a dhéanamh (Alt 11)

source: • Surrendering and having seized intoxicating liquor, etc., (Section 22)
ga: • Deoch mheisciúil is araile a thabhairt suas agus í a bheith gafa (Alt 22)

source: There is more information on the Adult Cautioning Scheme here
ga: Tá tuilleadh eolais faoin Scéim um Rabhadh Aosach anseo
